#перед началом настроила setwd() и скачала readxl

'''
Задание 1. 
С помощью функции str() определите, какого типа данные хранятся в столбцах Возраст и Глюкоза
''' 

library(readxl)
df = read_excel('Пациенты.xlsx')

str(df$Пол)
# chr [1:348] "ж" "ж" "ж" "м" "м" "ж" "ж" "м" ...
str(df$Возраст)    
# num [1:348] 61 61 69 58 34 65 53 56 78 75 ...

#Задание 2. Пол преобразовать в фактор

df$Пол <- factor(df$Пол, levels = c("м", "ж"))
levels(df$Пол)
# [1] "м" "ж"

'''
Задание 3. Создайте новый вектор возраст_группа_2, который будет делить пациентов на две группы:
"Молодые" (возраст <= 60 лет) и "Старшие" (возраст > 60 лет)
'''

df$возраст_группа_2 =ifelse(df$Возраст <= 60, "Молодые", "Старшие")

'''
Задание 4. Напишите команду, которая выведет на экран все данные для пациентов > 75
'''

df$Возраст[df$Возраст > 75]
#[1] 78 83 76 76 77 77 80 76 79 80 80 78 79 77 77 78 79 76 86 76 81
#[22] 86 80 76 80 77 83

'''
Задание 5. С помощью функций head() и summary() получите общее представление о переменных
Лейкоциты и Глюкоза
'''
head(df[, c("лейкоциты", "глюкоза")])
summary(df[,  c("лейкоциты", "глюкоза")])

'''
Задание 6. Используя функцию aggregate(), вычислите средний уровень глюкозы для мужчин и женщин
'''
aggregate(глюкоза ~ Пол, data = df, mean)

#  м 6.404896,  ж 6.841121

'''
Задание 7. Используя ранее созданную переменную возраст_группа_2, вычислите среднее значение
лейкоцитов отдельно для мужчин и женщин в каждой возрастной группе
'''

aggregate(лейкоциты ~ Пол + возраст_группа_2, 
          data = df, 
          FUN = mean)

'''
Задание 8. Напишите код, который с помощью aggregate() выводит для переменной Глюкоза по группам
Пол сразу несколько статистик: среднее значение, стандартное отклонение и количество
наблюдений в каждой группе
'''

functions <- list(mean = mean, sd = sd, length = length)
do.call(data.frame, 
        aggregate(глюкоза ~ Пол, data = df, 
                  FUN = function(x) c(mean = mean(x), sd = sd(x), n = length(x))))

#  Пол глюкоза.mean глюкоза.sd глюкоза.n
#1   м     6.404896   2.160624       241
#2   ж     6.841121   3.310702       107

'''
Задание 9. Напишите код, который с помощью aggregate() выводит для переменной Глюкоза по группам
Пол сразу несколько статистик: среднее значение, стандартное отклонение и количество
наблюдений в каждой группе

Тоже самое, что и задание 8
'''

'''
Задание 10. Постройте два боксплота (boxplot) в одной системе координат: один для распределения
глюкозы у мужчин, другой — у женщин. Добавьте заголовок графика и подписи к осям.
'''
library(ggplot2)
ggplot(df, aes(x = Пол, y = гемоглобин, fill = Пол)) +
  geom_boxplot() +
  scale_fill_manual(values = c("м" = "lightblue", "ж" = "lightpink")) +
  labs(
    title = "Распределение гемоглобина по полу",
    x = "Пол",
    y = "Уровень гемоглобина",
    fill = "Пол"
  ) +
  theme_minimal()
# куча выбросов вышло ахахах

'''
Задание 11. Проведите t-тест, чтобы проверить, различается ли средний уровень лейкоцитов между
мужчинами и женщинами. Сформулируйте нулевую и альтернативную гипотезу и
интерпретируйте полученный p-value

H0: нет статистически значимых отличий в среднем уровне лейкоцтов между мужчиенами и женщинами
H1: существуют статистически значимые отличия в среднем уровне лейкоцтов между мужчиенами и женщинами
Сначала посмотрю, похоже ли у они у меня на норм распределение через боксплот
'''
hist(df$лейкоциты)
#не похоже на нормальное, сильный правый хвост

# заменю пропущенные значения 
df$лейкоциты[is.na(df$лейкоциты)] <- median(df$лейкоциты, na.rm = TRUE)
ks.test(df$лейкоциты, "pnorm", mean = mean(df$лейкоциты), sd = sd(df$лейкоциты))
# D = 0.079554, p-value = 0.02444 - не подчиняется нормальному распределению

t.test(лейкоциты ~ Пол, 
                 data = df)
# t = 1.6819, df = 190.37, p-value = 0.09424
# принимаем нулевую гипотезу: стат разницы в распределении лейкоцитов по полу не обнаружено

wilcox.test(лейкоциты ~ Пол, data=df) 
# W = 14873, p-value = 0.02229 - серая зона, если альфа 0.05 то отклоняем нулевую гипотезу

'''
Задание 12. Напишите код, который подсчитает ОБЩЕЕ количество пропущенных значений (NA) во всем
датафрейме patients_task
'''

patients_task <- df
# Внесем пропущенные значения в столбец "Глюкоза"
patients_task$глюкоза[c(3, 15, 45)] <- NA
sum(is.na(patients_task))
# [1] 3

'''
Задание 13. Найдите номера строк, в которых значение переменной Глюкоза является пропущенным (NA)
'''

which(is.na(patients_task$глюкоза))
#[1]  3 15 45

'''
Задание 14. Создайте новый датафрейм patients_no_na, удалив из patients_task все строки, в которых есть
хотя бы один NA. Сравните размерность (функция dim()) исходного и нового датафреймов.
'''
patients_no_na <- na.omit(patients_task)
dim(patients_no_na) # [1] 345  10
dim(patient_task) # [1] 348   10
  
'''
Задание 15. В датафрейме patients_task замените все пропущенные значения в столбце Глюкоза на
медианное значение глюкозы по всем пациентам (рассчитанное с учетом na.rm = TRUE)
'''
df$лейкоциты[is.na(df$глюкоза)] <- median(df$глюкоза, na.rm = TRUE)

'''
Задание 16. Напишите код, который вычисляет среднее значение лейкоцитов по полу, игнорируя
пропущенные значения. Выполните это как для датафрейма patients_task (где есть NA), так и для
patients_no_na (где NA удалены). Отличаются ли результаты?
'''
aggregate(лейкоциты ~ Пол, data = patient_task,
          FUN = mean, na.rm = TRUE)
#   Пол лейкоциты
# 1   ж  7.708879
#2   м  8.228631

aggregate(лейкоциты ~ Пол, data = patients_no_na,
          FUN = mean)

# Пол лейкоциты
# 1   м  8.228631
# 2   ж  7.725481

'''
Задание 17. Рассчитайте среднее и стандартное отклонение гемоглобина для двух возрастных групп из
возраст_группа_2. Сохраните результат в переменную final_result. Переименуйте столбцы результата
так, чтобы было понятно, какая статистика в каком столбце находится.
'''

functions <- list(mean = mean, sd = sd, length = length)
final_results <- do.call(data.frame, 
        aggregate(гемоглобин ~ возраст_группа_2, data = df, 
                  FUN = function(x) c(mean = mean(x), sd = sd(x), n = length(x))))

'''
  возраст_группа_2 гемоглобин.mean гемоглобин.sd гемоглобин.n
1          Молодые        146.9763      16.13040          169
2          Старшие        137.1341      18.01229          179
'''

'''
Задание 18. Сохраните результат final_result в файл с именем "анализ_гемоглобина.csv". Убедитесь, что файл
сохранился в вашей рабочей директории.
'''

write.csv(final_results,  "анализ_гемоглобина.csv")
